Conf.Simple/src/InformationRegisters/SUI_НастройкиТаблицИнтеграции/SUI_НастройкиТаблицИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_НастройкиТаблицИнтеграции</name>
  <resources>
    <name>НастройкиКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ОсновнойОбъект</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СхемаКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>ТаблицаИнтеграции</name>
    <type>
      <types>EnumRef.SUI_ТаблицыИнтеграции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяОбъектаКонфигурации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/Enums/SUI_ТаблицыИнтеграции/SUI_ТаблицыИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ТаблицыИнтеграции</name>
  <enumValues>
    <name>Контрагенты</name>
  </enumValues>
  <enumValues>
    <name>Склады</name>
  </enumValues>
  <enumValues>
    <name>Ячейки</name>
  </enumValues>
  <enumValues>
    <name>Номенклатура</name>
  </enumValues>
  <enumValues>
    <name>ХарактеристикиНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>СерииНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ЕдиницыИзмерения</name>
  </enumValues>
  <enumValues>
    <name>УпаковкиНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>Удалить_ВидыНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыУпаковок</name>
  </enumValues>
  <enumValues>
    <name>Документы</name>
  </enumValues>
  <enumValues>
    <name>НастройкиДокументов</name>
  </enumValues>
  <enumValues>
    <name>ШаблоныЭтикеток</name>
  </enumValues>
  <enumValues>
    <name>ПользователиТСД</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/InformationRegisters/SUI_НастройкиТаблицИнтеграции/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//@skip-check export-procedure-missing-comment
#Область ПрограммныйИнтерфейс

Функция ПараметрыПолученияНастроек(ТаблицаИнтеграции = Неопределено, ИмяОбъекта = Неопределено) Экспорт
	
	Параметры = Новый Структура();
	
	Параметры.Вставить("ТаблицаИнтеграции", 	ТаблицаИнтеграции);
	Параметры.Вставить("ИмяОбъекта", 			ИмяОбъекта);
	Параметры.Вставить("Используется", 			Истина);
	Параметры.Вставить("Настраиваемая", 		Истина);
	Параметры.Вставить("НастройкиЗаполнены", 	Истина);
	Параметры.Вставить("ОсновнойОбъект");

	Возврат Параметры;
	
КонецФункции

Функция ПолучитьНастройки(ПараметрыОтбора) Экспорт
	
	СхемаНастройки = ПолучитьМакет("НастройкиТаблиц");
	
	Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных();
	SUI_КомпоновкаДанныхСервер.ИнициализироватьКомпоновщикНастроек(Компоновщик, СхемаНастройки);
	
	Если ПараметрыОтбора.ТаблицаИнтеграции <> Неопределено Тогда
		SUI_КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Компоновщик, "ТаблицаИнтеграции", ПараметрыОтбора.ТаблицаИнтеграции);
	КонецЕсли;
	
	Если ПараметрыОтбора.ИмяОбъекта <> Неопределено Тогда
		SUI_КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Компоновщик, "ИмяОбъекта", ПараметрыОтбора.ИмяОбъекта);
	КонецЕсли;
	
	Если ПараметрыОтбора.НастройкиЗаполнены <> Неопределено Тогда
		SUI_КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Компоновщик, "НастройкиЗаполнены", ПараметрыОтбора.НастройкиЗаполнены);
		SUI_КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Компоновщик, "НастройкиНеЗаполнены", Не ПараметрыОтбора.НастройкиЗаполнены);
	КонецЕсли;
	
	Если ПараметрыОтбора.ОсновнойОбъект <> Неопределено Тогда
		SUI_КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(Компоновщик, "ОсновнойОбъект", ПараметрыОтбора.ОсновнойОбъект);
	КонецЕсли;
	
	Если ПараметрыОтбора.Используется <> Неопределено Тогда
		SUI_КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(Компоновщик, "Используется", ПараметрыОтбора.Используется);
	КонецЕсли;
	
	Если ПараметрыОтбора.Настраиваемая <> Неопределено Тогда
		SUI_КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(Компоновщик, "Настраиваемая", ПараметрыОтбора.Настраиваемая);
	КонецЕсли;
	
	ПараметрыРезультата = SUI_КомпоновкаДанныхСервер.ПараметрыРезультатСхемыКомпоновкиДанных();
	ПараметрыРезультата.СхемаКомпоновкиДанных 					= СхемаНастройки;
	ПараметрыРезультата.НастройкиКомпоновкиДанных 				= Компоновщик.ПолучитьНастройки();
	ПараметрыРезультата.ВозможностьИспользованияВнешнихФункций 	= Истина;
	ПараметрыРезультата.ВыполнятьВПривилегированномРежиме 		= Истина;
	
	Возврат SUI_КомпоновкаДанныхСервер.ВыгрузитьРезультатСхемыКомпоновкиДанных(ПараметрыРезультата);
	
КонецФункции

Функция ЗагрузитьНастройки(Знач ТаблицаНастроек, ПерезаписатьВсе = Ложь) Экспорт

	ТаблицыИнтеграции = SUI_НастройкиМетаданныхПовтИсп.ТаблицыИнтеграции();
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_НастройкиТаблицИнтеграции");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
		Если Не ПерезаписатьВсе Тогда
			ЭлементБлокировки.ИсточникДанных = ТаблицаНастроек;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ТаблицаИнтеграции", "ТаблицаИнтеграции");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ИмяОбъектаКонфигурации", "ИмяОбъекта");
		КонецЕсли;
		Блокировка.Заблокировать();
		
		Если ПерезаписатьВсе Тогда
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Записать(Истина);
		КонецЕсли;
		
		Для Каждого СтрокаТаблицы Из ТаблицаНастроек Цикл
			
			ПараметрыПроверки = ПараметрыПроверкиНастройки();
			ЗаполнитьЗначенияСвойств(ПараметрыПроверки, СтрокаТаблицы);
			
			Если Не ЗначениеЗаполнено(ПараметрыПроверки.ТаблицаИнтеграции) Тогда
				Продолжить;
			КонецЕсли;
			
			Если SUI_НастройкиМетаданныхПовтИсп.ТаблицыИнтеграции()
				.НайтиПоЗначению(ПараметрыПроверки.ТаблицаИнтеграции) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если ПустаяСтрока(ПараметрыПроверки.ИмяОбъекта) Тогда
				SUI_НастройкиМетаданныхСервер.УстановитьПризнакИспользованияТаблицы(СтрокаТаблицы.ТаблицаИнтеграции, 
					Ложь, Истина);
				Продолжить;
			КонецЕсли;
			
			Результат = ПроверитьНастройку(ПараметрыПроверки);
			
			Если Результат.КритическаяОшибка Тогда
				SUI_НастройкиМетаданныхСервер.УстановитьПризнакИспользованияТаблицы(СтрокаТаблицы.ТаблицаИнтеграции, 
					Ложь, Ложь);
				Продолжить;
			КонецЕсли;
			
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ТаблицаИнтеграции.Установить(ПараметрыПроверки.ТаблицаИнтеграции);
			НаборЗаписей.Отбор.ИмяОбъектаКонфигурации.Установить(ПараметрыПроверки.ИмяОбъекта);
			
			Запись = НаборЗаписей.Добавить();
			Запись.ТаблицаИнтеграции 			= ПараметрыПроверки.ТаблицаИнтеграции;
			Запись.ИмяОбъектаКонфигурации 		= ПараметрыПроверки.ИмяОбъекта;
			Запись.ОсновнойОбъект 				= ПараметрыПроверки.ОсновнойОбъект;
			Запись.СхемаКомпоновкиДанных 		= Новый ХранилищеЗначения(ПараметрыПроверки.СхемаКомпоновкиДанных, Новый СжатиеДанных(9));
			Запись.НастройкиКомпоновкиДанных 	= Новый ХранилищеЗначения(ПараметрыПроверки.НастройкиКомпоновкиДанных, Новый СжатиеДанных(9));
			
			Если НаборЗаписей.ПроверитьЗаполнение() Тогда
				НаборЗаписей.Записать(Истина);
			Иначе
				SUI_НастройкиМетаданныхСервер.УстановитьПризнакИспользованияТаблицы(СтрокаТаблицы.ТаблицаИнтеграции, 
					Ложь, Ложь);
				Продолжить;
			КонецЕсли;
			
			НайденнаяТаблица = ТаблицыИнтеграции.НайтиПоЗначению(ПараметрыПроверки.ТаблицаИнтеграции);
			Если НайденнаяТаблица <> Неопределено Тогда
				НайденнаяТаблица.Пометка = СтрокаТаблицы.Используется;
			КонецЕсли;
			
			SUI_НастройкиМетаданныхСервер.УстановитьПризнакИспользованияТаблицы(СтрокаТаблицы.ТаблицаИнтеграции, 
				СтрокаТаблицы.Используется, Ложь);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат ТаблицыИнтеграции;
	
КонецФункции

Функция ПолучитьРезультатПоИсточникуДанных(ИсточникДанных, АдресРезультата = Неопределено) Экспорт
	
	Результат = Новый Массив();
	
	ПараметрыНастроек = ПараметрыПолученияНастроек(, ИсточникДанных.Метаданные().ПолноеИмя());
	
	Настройки = ПолучитьНастройки(ПараметрыНастроек);
	
	Если Настройки.Количество() > 0 Тогда
		
		Для Каждого Настройка Из Настройки Цикл
			
			ПараметрыВыгрузки = ПараметрыВыгрузкиРезультата(Настройка.СхемаКомпоновкиДанных,
				Настройка.НастройкиКомпоновкиДанных, ИсточникДанных);
			
			РезультатПоНастройке = ВыгрузитьРезультатПоНастройке(ПараметрыВыгрузки);
			
			Если РезультатПоНастройке.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			РезультатПоНастройке = Новый Структура("Данные", РезультатПоНастройке);
			РезультатПоНастройке.Вставить("ТаблицаИнтеграции", Настройка.ТаблицаИнтеграции);
			РезультатПоНастройке.Вставить("ИмяТаблицы", Настройка.ИмяТаблицы);
			РезультатПоНастройке.Вставить("ИмяОбъекта", Настройка.ИмяОбъекта);
			
			Результат.Добавить(РезультатПоНастройке);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если АдресРезультата = Неопределено Тогда
		Возврат Результат;
	Иначе
		
		Если ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
			Возврат ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
		Иначе
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли;

КонецФункции

Функция ПолучитьРезультатПоТаблицеИнтеграции(ТаблицаИнтеграции, ИмяОбъекта = Неопределено, АдресРезультата = Неопределено) Экспорт
	
	Результат = Новый Массив();
	
	ПараметрыНастроек = ПараметрыПолученияНастроек(ТаблицаИнтеграции, ИмяОбъекта);
	
	Настройки = ПолучитьНастройки(ПараметрыНастроек);
	
	Если Настройки.Количество() > 0 Тогда
		
		Для Каждого Настройка Из Настройки Цикл
			
			ПараметрыВыгрузки = ПараметрыВыгрузкиРезультата(Настройка.СхемаКомпоновкиДанных, Настройка.НастройкиКомпоновкиДанных);
				
			РезультатПоНастройке = ВыгрузитьРезультатПоНастройке(ПараметрыВыгрузки);
			
			Если РезультатПоНастройке.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			РезультатПоНастройке = Новый Структура("Данные", РезультатПоНастройке);
			РезультатПоНастройке.Вставить("ТаблицаИнтеграции", Настройка.ТаблицаИнтеграции);
			РезультатПоНастройке.Вставить("ИмяТаблицы", Настройка.ИмяТаблицы);
			РезультатПоНастройке.Вставить("ИмяОбъекта", Настройка.ИмяОбъекта);
			
			Результат.Добавить(РезультатПоНастройке);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если АдресРезультата = Неопределено Тогда
		Возврат Результат;
	Иначе
		
		Если ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
			Возврат ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
		Иначе
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

Функция ПараметрыВыгрузкиРезультата(СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных, ИсточникДанных = Неопределено,
	ВключитьСлужебныеРеквизиты = Истина, ИменаКолонокПоЗаголовку = Истина) Экспорт
	
	ПараметрыВыгрузки = Новый Структура();
	
	ПараметрыВыгрузки.Вставить("СхемаКомпоновкиДанных", 	СхемаКомпоновкиДанных);
	ПараметрыВыгрузки.Вставить("НастройкиКомпоновкиДанных", НастройкиКомпоновкиДанных);
	ПараметрыВыгрузки.Вставить("ИсточникДанных", 			ИсточникДанных);
	ПараметрыВыгрузки.Вставить("ИменаКолонокПоЗаголовку", 	ИменаКолонокПоЗаголовку);
	ПараметрыВыгрузки.Вставить("ПрефиксСлужебногоПоля",		"SUI_СлужебноеПоле_");
	ПараметрыВыгрузки.Вставить("СлужебныеПоля", 			Новый Массив());
	
	Возврат ПараметрыВыгрузки;
	
КонецФункции

// Выгрузить результат по настройке.
// 
// Параметры:
//  ПараметрыВыгрузки - Структура - Параметры выгрузки результата см. РегистрСведений.SUI_НастройкиТаблицИнтеграции.ПараметрыВыгрузкиРезультата
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Выгрузить результат по настройке
//@skip-check doc-comment-ref-link
Функция ВыгрузитьРезультатПоНастройке(ПараметрыВыгрузки) Экспорт
	
	НастройкиКомпоновкиДанных = ПараметрыВыгрузки.НастройкиКомпоновкиДанных;

	Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных();
	SUI_КомпоновкаДанныхСервер.ИнициализироватьКомпоновщикНастроек(Компоновщик, ПараметрыВыгрузки.СхемаКомпоновкиДанных, 
		НастройкиКомпоновкиДанных);
	
	НастройкиКомпоновкиДанных = Компоновщик.ПолучитьНастройки();
	
	ДобавитьСлужебныеПоляВыбора(НастройкиКомпоновкиДанных, ПараметрыВыгрузки.СлужебныеПоля, ПараметрыВыгрузки.ПрефиксСлужебногоПоля);
	
	УстановитьПараметрыПоИсточнику(НастройкиКомпоновкиДанных, ПараметрыВыгрузки.ИсточникДанных);
	
	ПараметрыРезультата = SUI_КомпоновкаДанныхСервер.ПараметрыРезультатСхемыКомпоновкиДанных();
	ПараметрыРезультата.СхемаКомпоновкиДанных = ПараметрыВыгрузки.СхемаКомпоновкиДанных;
	ПараметрыРезультата.НастройкиКомпоновкиДанных = НастройкиКомпоновкиДанных;
	ПараметрыРезультата.ВозможностьИспользованияВнешнихФункций = Истина;
	ПараметрыРезультата.ВыполнятьВПривилегированномРежиме = Истина;
	
	Результат = SUI_КомпоновкаДанныхСервер.ВыгрузитьРезультатСхемыКомпоновкиДанных(ПараметрыРезультата);
	
	Если ПараметрыВыгрузки.ИменаКолонокПоЗаголовку Тогда
		
		РезрешенныеСимволы = SUI_СтроковыеФункцииКлиентСервер.АлфавитБуквыЛатинские()
			+ SUI_СтроковыеФункцииКлиентСервер.АлфавитБуквыРусские()
			+ SUI_СтроковыеФункцииКлиентСервер.АлфавитЦифры()
			+ "_";
		
		Для Каждого Колонка Из Результат.Колонки Цикл
			
			НовоеИмяКолонки = SUI_СтроковыеФункцииКлиентСервер.ПривестиСтрокуКРазрешеннымСимволам(Колонка.Заголовок, РезрешенныеСимволы);
			
			Если Не ПустаяСтрока(НовоеИмяКолонки) Тогда
				Колонка.Имя = НовоеИмяКолонки;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	//@skip-check constructor-function-return-section
	Возврат Результат;
	
КонецФункции

Функция ПолучитьВыбранныеРеквизиты(ТаблицаИнтеграции, ТаблицаИспользуется = Истина, ПоОсновномуОбъекту = Истина) Экспорт
	
	ПараметрыПолученияНастроек = ПараметрыПолученияНастроек(ТаблицаИнтеграции);
	ПараметрыПолученияНастроек.Используется = ТаблицаИспользуется;
	ПараметрыПолученияНастроек.ОсновнойОбъект = ПоОсновномуОбъекту;
	
	НастройкиТаблицы = ПолучитьНастройки(ПараметрыПолученияНастроек);
	Если НастройкиТаблицы.Количество() = 0 Тогда
		НастройкиТаблицы = Неопределено;
	Иначе
		НастройкиТаблицы = НастройкиТаблицы[0];
	КонецЕсли;

	Возврат ПолучитьВыбранныеРеквизитыИзНастройки(НастройкиТаблицы);
	
КонецФункции

Функция ПолучитьВыбранныеРеквизитыИзНастройки(НастройкаТаблицы) Экспорт
	
	ВыбранныеРеквизиты = Новый Соответствие();
	
	Если НастройкаТаблицы <> Неопределено Тогда
	
		Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных();
		SUI_КомпоновкаДанныхСервер.ИнициализироватьКомпоновщикНастроек(Компоновщик, 
			НастройкаТаблицы.СхемаКомпоновкиДанных, НастройкаТаблицы.НастройкиКомпоновкиДанных);
		
		НастройкиКомпоновки = Компоновщик.ПолучитьНастройки();
		
		Для Каждого ЭлементВыбора Из НастройкиКомпоновки.Выбор.Элементы Цикл
			
			Если Не ЭлементВыбора.Использование Тогда
				Продолжить;
			КонецЕсли;
			
			ДанныеВыбранногоПоля = Новый Структура("Имя, Тип");
			
			ДоступноеПоле = НастройкиКомпоновки.Выбор.ДоступныеПоляВыбора.НайтиПоле(ЭлементВыбора.Поле);
			
			Если Не СтрНачинаетсяС(Строка(ЭлементВыбора.Поле), "ПользовательскиеПоля.") Тогда
				ДанныеВыбранногоПоля.Имя = Строка(ЭлементВыбора.Поле);
			КонецЕсли;
			
			Если ДоступноеПоле <> Неопределено Тогда
				ДанныеВыбранногоПоля.Тип = ДоступноеПоле.ТипЗначения;
			КонецЕсли;
			
			Если Не ПустаяСтрока(ЭлементВыбора.Заголовок) Тогда
				Заголовок = ЭлементВыбора.Заголовок;
			ИначеЕсли ДоступноеПоле <> Неопределено И Не ПустаяСтрока(ДоступноеПоле.Заголовок) Тогда
				Заголовок = ДоступноеПоле.Заголовок;
			Иначе
				Заголовок = ДанныеВыбранногоПоля.Имя;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Заголовок) Тогда
				ВыбранныеРеквизиты.Вставить(Заголовок, ДанныеВыбранногоПоля);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Новый ФиксированноеСоответствие(ВыбранныеРеквизиты);
		
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура СформироватьДеревоНастроек(Параметры, АдресРезультата) Экспорт
	
	ДеревоНастроек = Новый ДеревоЗначений();
	
	ДеревоНастроек.Колонки.Добавить("ТаблицаИнтеграции", 			Новый ОписаниеТипов("ПеречислениеСсылка.SUI_ТаблицыИнтеграции"));
	ДеревоНастроек.Колонки.Добавить("ИмяОбъектаКонфигурации", 		Новый ОписаниеТипов("Строка"));
	ДеревоНастроек.Колонки.Добавить("СхемаКомпоновкиДанных", 		Новый ОписаниеТипов("Строка"));
	ДеревоНастроек.Колонки.Добавить("НастройкиКомпоновкиДанных", 	Новый ОписаниеТипов("Строка"));
	ДеревоНастроек.Колонки.Добавить("ОсновнойОбъект", 				Новый ОписаниеТипов("Булево"));
	ДеревоНастроек.Колонки.Добавить("Представление", 				Новый ОписаниеТипов("Строка"));
	ДеревоНастроек.Колонки.Добавить("ЭтоСтрокаТаблицы", 			Новый ОписаниеТипов("Булево"));
	ДеревоНастроек.Колонки.Добавить("ИндексКартинки", 				ОбщегоНазначения.ОписаниеТипаЧисло(2, , ДопустимыйЗнак.Неотрицательный));
	ДеревоНастроек.Колонки.Добавить("ЕстьОшибки",					Новый ОписаниеТипов("Булево"));
	ДеревоНастроек.Колонки.Добавить("Ключ",							Новый ОписаниеТипов("УникальныйИдентификатор"));

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицыИнтеграции.Ссылка КАК ТаблицаИнтеграции,
		|	ЕСТЬNULL(НастройкиТаблицИнтеграции.ИмяОбъектаКонфигурации, """") КАК ИмяОбъектаКонфигурации,
		|	ЕСТЬNULL(НастройкиТаблицИнтеграции.СхемаКомпоновкиДанных, НЕОПРЕДЕЛЕНО) КАК СхемаКомпоновкиДанных,
		|	ЕСТЬNULL(НастройкиТаблицИнтеграции.НастройкиКомпоновкиДанных, НЕОПРЕДЕЛЕНО) КАК НастройкиКомпоновкиДанных,
		|	ЕСТЬNULL(НастройкиТаблицИнтеграции.ОсновнойОбъект, Ложь) КАК ОсновнойОбъект
		|ИЗ
		|	Перечисление.SUI_ТаблицыИнтеграции КАК ТаблицыИнтеграции
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.SUI_НастройкиТаблицИнтеграции КАК НастройкиТаблицИнтеграции
		|		ПО ТаблицыИнтеграции.Ссылка = НастройкиТаблицИнтеграции.ТаблицаИнтеграции
		|ГДЕ
		|	ТаблицыИнтеграции.Ссылка В (&ТаблицыИнтеграции)
		|	И НЕ ТаблицыИнтеграции.Ссылка В (&ИсключаемыеТаблицыИнтеграции)
		|	И ВЫБОР
		|		КОГДА &ТаблицаИнтеграции = НЕОПРЕДЕЛЕНО
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ТаблицыИнтеграции.Ссылка = &ТаблицаИнтеграции
		|	КОНЕЦ
		|	И ВЫБОР
		|		КОГДА &ИмяОбъектаКонфигурации = НЕОПРЕДЕЛЕНО
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ НастройкиТаблицИнтеграции.ИмяОбъектаКонфигурации = &ИмяОбъектаКонфигурации
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТаблицыИнтеграции.Порядок,
		|	ОсновнойОбъект УБЫВ
		|ИТОГИ
		|ПО
		|	ТаблицаИнтеграции";

	Запрос.УстановитьПараметр("ИсключаемыеТаблицыИнтеграции", ИсключаемыеТаблицыИнтеграции());
	Запрос.УстановитьПараметр("ТаблицыИнтеграции", 		SUI_НастройкиМетаданныхПовтИсп.ТаблицыИнтеграции());
	Запрос.УстановитьПараметр("ТаблицаИнтеграции", 		SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ТаблицаИнтеграции"));
	Запрос.УстановитьПараметр("ИмяОбъектаКонфигурации", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИмяОбъектаКонфигурации"));

	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока Выборка.Следующий() Цикл
						
			СтрокаТаблица 					= ДеревоНастроек.Строки.Добавить();
			СтрокаТаблица.ЭтоСтрокаТаблицы 	= Истина;
			СтрокаТаблица.ТаблицаИнтеграции = Выборка.ТаблицаИнтеграции;
			СтрокаТаблица.Представление 	= ПредставлениеСтрокиДерева(СтрокаТаблица.ТаблицаИнтеграции);
			СтрокаТаблица.Ключ 				= Новый УникальныйИдентификатор();

			ДетальныеЗаписи = Выборка.Выбрать();
			
			Пока ДетальныеЗаписи.Следующий() Цикл
				
				Если Не ЗначениеЗаполнено(ДетальныеЗаписи.ИмяОбъектаКонфигурации) Или
					Не ПроверитьОбъектКонфигурации(ДетальныеЗаписи.ИмяОбъектаКонфигурации) Тогда
					Продолжить;
				КонецЕсли;

				СтрокаНастройка = СтрокаТаблица.Строки.Добавить();
				СтрокаНастройка.ТаблицаИнтеграции 		= ДетальныеЗаписи.ТаблицаИнтеграции;
				СтрокаНастройка.ИмяОбъектаКонфигурации 	= ДетальныеЗаписи.ИмяОбъектаКонфигурации;
				СтрокаНастройка.ОсновнойОбъект 			= ДетальныеЗаписи.ОсновнойОбъект;
				СтрокаНастройка.Представление 			= ПредставлениеСтрокиДерева(СтрокаНастройка.ИмяОбъектаКонфигурации);
				СтрокаНастройка.ИндексКартинки 			= ИндексКартинкиПоИмениОбъекта(СтрокаНастройка.ИмяОбъектаКонфигурации);
				СтрокаНастройка.Ключ 					= Новый УникальныйИдентификатор();
				
				СхемаКомпоновкиДанных = ДетальныеЗаписи.СхемаКомпоновкиДанных;
				Если ЗначениеЗаполнено(СхемаКомпоновкиДанных) Тогда
					СхемаКомпоновкиДанных = СхемаКомпоновкиДанных.Получить();
				КонецЕсли;
				
				Если ТипЗнч(СхемаКомпоновкиДанных) <> Тип("СхемаКомпоновкиДанных") Тогда
					СхемаКомпоновкиДанных = Неопределено;
				КонецЕсли;
				
				СтрокаНастройка.СхемаКомпоновкиДанных = ОбщегоНазначения.ЗначениеВСтрокуXML(СхемаКомпоновкиДанных);
				
				НастройкиКомпоновкиДанных = ДетальныеЗаписи.НастройкиКомпоновкиДанных;
				Если ЗначениеЗаполнено(НастройкиКомпоновкиДанных) Тогда
					НастройкиКомпоновкиДанных = НастройкиКомпоновкиДанных.Получить();
				КонецЕсли;
				
				Если ТипЗнч(НастройкиКомпоновкиДанных) <> Тип("НастройкиКомпоновкиДанных") Тогда
					НастройкиКомпоновкиДанных = Неопределено;
				КонецЕсли;
				
				СтрокаНастройка.НастройкиКомпоновкиДанных = ОбщегоНазначения.ЗначениеВСтрокуXML(НастройкиКомпоновкиДанных);

			КонецЦикла;
			
		КонецЦикла;
	
	КонецЕсли;

	ПоместитьВоВременноеХранилище(ДеревоНастроек, АдресРезультата);
	
КонецПроцедуры

Функция ДоступныеВидыОбъектовКНастройке() Экспорт
	
	ВидыОбъектов = Новый Массив();
	
	ВидыОбъектов.Добавить("СПРАВОЧНИК");
	ВидыОбъектов.Добавить("РЕГИСТРСВЕДЕНИЙ");
	
	Возврат Новый ФиксированныйМассив(ВидыОбъектов);
		
КонецФункции

Функция ВидОбъектаКонфигурации(ИмяОбъектаМетаданных) Экспорт
	
	ЧастиИмени = СтрРазделить(ИмяОбъектаМетаданных, ".");
	Возврат ?(ЧастиИмени.Количество() > 0, ЧастиИмени[0], "");
	
КонецФункции

Функция ИндексКартинкиПоИмениОбъекта(ИмяОбъектаМетаданных) Экспорт
	
	ВидОбъекта = ВРег(ВидОбъектаКонфигурации(ИмяОбъектаМетаданных));
	
	Если ВидОбъекта = "КОНСТАНТА" Тогда
		Возврат 1;
	ИначеЕсли ВидОбъекта = "СПРАВОЧНИК" Тогда
		Возврат 3;
	ИначеЕсли ВидОбъекта = "ПОСЛЕДОВАТЕЛЬНОСТЬ" Тогда
		Возврат 5;
	ИначеЕсли ВидОбъекта = "ДОКУМЕНТ" Тогда
		Возврат 7;
	ИначеЕсли ВидОбъекта = "ПЛАНВИДОВХАРАКТЕРИСТИК" Тогда
		Возврат 9;
	ИначеЕсли ВидОбъекта = "ПЛАНСЧЕТОВ" Тогда
		Возврат 11;
	ИначеЕсли ВидОбъекта = "ПЛАНВИДОВРАСЧЕТА" Тогда
		Возврат 13;
	ИначеЕсли ВидОбъекта = "РЕГИСТРСВЕДЕНИЙ" Тогда
		Возврат 15;
	ИначеЕсли ВидОбъекта = "РЕГИСТРНАКОПЛЕНИЯ" Тогда
		Возврат 17;
	ИначеЕсли ВидОбъекта = "РЕГИСТРБУХГАЛТЕРИИ" Тогда
		Возврат 19;
	ИначеЕсли ВидОбъекта = "РЕГИСТРРАСЧЕТА" Тогда
		Возврат 21;
	ИначеЕсли ВидОбъекта = "БИЗНЕСПРОЦЕСС" Тогда
		Возврат 23;
	ИначеЕсли ВидОбъекта = "ЗАДАЧА" Тогда
		Возврат 25;
	Иначе
		Возврат 99;
	КонецЕсли;

КонецФункции

Функция ПредставлениеСтрокиДерева(Значение) Экспорт
	
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		
		ВидОбъекта = ВидОбъектаКонфигурации(Значение);
		
		МетаданныеЗначения = Метаданные.НайтиПоПолномуИмени(Значение);
		
		Если МетаданныеЗначения <> Неопределено Тогда
			Возврат МетаданныеЗначения.Синоним + ?(ПустаяСтрока(ВидОбъекта), "", " (" + ВидОбъекта + ")");
		КонецЕсли;

	КонецЕсли;
	
	Возврат Строка(Значение);
	
КонецФункции

Функция ПроверитьОбъектКонфигурации(ПолноеИмяОбъекта) Экспорт
	
	ТекстОшибки = "";
	
	ВидОбъекта = ВидОбъектаКонфигурации(ПолноеИмяОбъекта);
	Если ДоступныеВидыОбъектовКНастройке().Найти(ВРег(ВидОбъекта)) = Неопределено Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Вид объекта ""%1"" не доступен для настройки (%2)'"), ВидОбъекта, ПолноеИмяОбъекта);
	КонецЕсли;
	
	Если ПустаяСтрока(ТекстОшибки) Тогда
		МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ПолноеИмяОбъекта);
		Если МетаданныеОбъекта = Неопределено Тогда
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Объект ""%1"" не принадлежит текущей конфигурации'"), ПолноеИмяОбъекта);
		КонецЕсли;
	КонецЕсли;
	
	Если ПустаяСтрока(ТекстОшибки) Тогда
		Возврат Истина;
	Иначе
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьКолонкиТаблицыИнтеграции(ТаблицаИнтеграции) Экспорт
	
	КолонкиТаблицы = Новый ТаблицаЗначений();
	КолонкиТаблицы.Колонки.Добавить("Имя", 			ОбщегоНазначения.ОписаниеТипаСтрока(100));
	КолонкиТаблицы.Колонки.Добавить("Обязательный", Новый ОписаниеТипов("Булево"));
	КолонкиТаблицы.Колонки.Добавить("Описание", 	ОбщегоНазначения.ОписаниеТипаСтрока(0));
	
	ИмяТаблицыВКонфигурации = SUI_НастройкиМетаданныхСервер.ПолучитьИмяТаблицыВКонфигурации(ТаблицаИнтеграции);
	
	Если ИмяТаблицыВКонфигурации = Неопределено Тогда
		Возврат КолонкиТаблицы;
	КонецЕсли;
	
	МетаданныеТаблицыРегистра = Метаданные.НайтиПоПолномуИмени(ИмяТаблицыВКонфигурации);
	
	Для Каждого ИзмерениеТаблицыРегистра Из МетаданныеТаблицыРегистра.Измерения Цикл
		
		НоваяСтрока = КолонкиТаблицы.Добавить();
		НоваяСтрока.Имя = ИзмерениеТаблицыРегистра.Имя;
		НоваяСтрока.Описание = ИзмерениеТаблицыРегистра.Подсказка;
		
		Если ИзмерениеТаблицыРегистра.ЗапрещатьНезаполненныеЗначения Или 
			ИзмерениеТаблицыРегистра.ПроверкаЗаполнения = ПроверкаЗаполнения.ВыдаватьОшибку Тогда
			НоваяСтрока.Обязательный = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого РесурсТаблицыРегистра Из МетаданныеТаблицыРегистра.Ресурсы Цикл
		
		НоваяСтрока = КолонкиТаблицы.Добавить();
		НоваяСтрока.Имя = РесурсТаблицыРегистра.Имя;
		НоваяСтрока.Описание = РесурсТаблицыРегистра.Подсказка;
		
		Если РесурсТаблицыРегистра.ПроверкаЗаполнения = ПроверкаЗаполнения.ВыдаватьОшибку Тогда
			НоваяСтрока.Обязательный = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат КолонкиТаблицы;
	
КонецФункции

Функция ПараметрыСКДПоОбъектуКонфигурации(ПолноеИмяОбъекта) Экспорт
	
	ПараметрыСКД = Новый Массив();
	
	ВидОбъекта = ВРег(ВидОбъектаКонфигурации(ПолноеИмяОбъекта));
	
	Если ВидОбъекта = "СПРАВОЧНИК" Или ВидОбъекта = "ДОКУМЕНТ" Или ВидОбъекта = "ПЛАНВИДОВХАРАКТЕРИСТИК" Или
		ВидОбъекта = "БИЗНЕСПРОЦЕСС" Или ВидОбъекта = "ЗАДАЧА" Тогда
		
		ПараметрыСКД.Добавить("Ссылка");
	
	ИначеЕсли  ВидОбъекта = "РЕГИСТРСВЕДЕНИЙ" Или ВидОбъекта = "РЕГИСТРНАКОПЛЕНИЯ" Тогда
		
		НаборЗаписей = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмяОбъекта).СоздатьНаборЗаписей();
		
		Для Каждого ЭлементОтбора Из НаборЗаписей.Отбор Цикл
			ПараметрыСКД.Добавить(ЭлементОтбора.Имя);
		КонецЦикла;

	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(ПараметрыСКД);
	
КонецФункции

Процедура СформироватьТабличныйДокументРезультатПоСхеме(Параметры, АдресРезультата) Экспорт
	
	Результат = Новый ТабличныйДокумент();
	
	СхемаКомпоновкиДанных = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "СхемаКомпоновкиДанных");
	НастройкиКомпоновкиДанных = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "НастройкиКомпоновкиДанных");
	
	ОбщегоНазначенияКлиентСервер.Проверить(ТипЗнч(СхемаКомпоновкиДанных) = Тип("СхемаКомпоновкиДанных"),
		НСтр("ru = 'Не передана схема компоновки данных'"));
	
	ОбщегоНазначенияКлиентСервер.Проверить(ТипЗнч(НастройкиКомпоновкиДанных) = Тип("НастройкиКомпоновкиДанных"),
		НСтр("ru = 'Не переданы настройки компоновки данных'"));
	
    ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных();
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	
    МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных, ДанныеРасшифровки);

    ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных();
    ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);
	
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент();
    ПроцессорВывода.УстановитьДокумент(Результат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры

Процедура ПроверитьНастройкиКомпоновкиДанных(Параметры, АдресРезультата) Экспорт
	
	КлючиСтрокОшибок = Новый Массив();
	
	ДеревоКПроверке = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ДеревоКПроверке", Новый ДеревоЗначений(), Тип("ДеревоЗначений"));
	КлючСтроки = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "КлючСтроки", 
		ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор(), Тип("УникальныйИдентификатор"));

	Если ЗначениеЗаполнено(КлючСтроки) Тогда
		
		СтрокиДереваПоКлючу = ДеревоКПроверке.Строки.НайтиСтроки(Новый Структура("Ключ", КлючСтроки), Истина);
		
		Если СтрокиДереваПоКлючу.Количество() = 1 Тогда
			ПроверитьНастройкиВСтрокеДерева(СтрокиДереваПоКлючу[0], ДеревоКПроверке, КлючиСтрокОшибок);
		КонецЕсли;

	Иначе

		Для Каждого СтрокаДерева Из ДеревоКПроверке.Строки Цикл
			ПроверитьНастройкиВСтрокеДерева(СтрокаДерева, ДеревоКПроверке, КлючиСтрокОшибок);
		КонецЦикла;
		
	КонецЕсли;
	
	КлючиСтрокОшибок = ОбщегоНазначенияКлиентСервер.СвернутьМассив(КлючиСтрокОшибок);

	ПоместитьВоВременноеХранилище(Новый ФиксированныйМассив(КлючиСтрокОшибок), АдресРезультата);
	
КонецПроцедуры

Процедура СохранитьДеревоНастроек(ДеревоНастроек) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		Для Каждого СтрокаДерева Из ДеревоНастроек.Строки Цикл
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_НастройкиТаблицИнтеграции");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
			ЭлементБлокировки.УстановитьЗначение("ТаблицаИнтеграции", СтрокаДерева.ТаблицаИнтеграции);
			Блокировка.Заблокировать();
			
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ТаблицаИнтеграции.Установить(СтрокаДерева.ТаблицаИнтеграции);
			НаборЗаписей.Записать(Истина);
				
			Для Каждого ДочерняяСтрока Из СтрокаДерева.Строки Цикл
				
				СхемаКД = ОбщегоНазначения.ЗначениеИзСтрокиXML(ДочерняяСтрока.СхемаКомпоновкиДанных);
				
				Если ТипЗнч(СхемаКД) <> Тип("СхемаКомпоновкиДанных") Тогда
					СхемаКД = Неопределено;
				КонецЕсли;
				
				НастройкиКД = ОбщегоНазначения.ЗначениеИзСтрокиXML(ДочерняяСтрока.НастройкиКомпоновкиДанных);
				
				Если ТипЗнч(НастройкиКД) <> Тип("НастройкиКомпоновкиДанных") Тогда
					НастройкиКД = Неопределено;
				КонецЕсли;
				
				НаборЗаписей = СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ТаблицаИнтеграции.Установить(СтрокаДерева.ТаблицаИнтеграции);
				НаборЗаписей.Отбор.ИмяОбъектаКонфигурации.Установить(ДочерняяСтрока.ИмяОбъектаКонфигурации);
				
				Запись = НаборЗаписей.Добавить();
				Запись.ТаблицаИнтеграции 			= СтрокаДерева.ТаблицаИнтеграции;
				Запись.ИмяОбъектаКонфигурации 		= ДочерняяСтрока.ИмяОбъектаКонфигурации;
				Запись.ОсновнойОбъект 				= ДочерняяСтрока.ОсновнойОбъект;
				Запись.СхемаКомпоновкиДанных 		= Новый ХранилищеЗначения(СхемаКД, Новый СжатиеДанных(9));
				Запись.НастройкиКомпоновкиДанных 	= Новый ХранилищеЗначения(НастройкиКД, Новый СжатиеДанных(9));
				
				НаборЗаписей.Записать(Истина);
				
			КонецЦикла;
			
		КонецЦикла;

		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Функция СхемаКомпоновкиДанныхИзХранилища(Хранилище) Экспорт
	
	Перем Схема;
	
	Если ТипЗнч(Хранилище) = Тип("ХранилищеЗначения") Тогда
		Схема = Хранилище.Получить();
		Схема = ?(ТипЗнч(Схема) = Тип("СхемаКомпоновкиДанных"), Схема, Неопределено);
	КонецЕсли;
	
	Возврат Схема;
	
КонецФункции

Функция НастройкиКомпоновкиДанныхИзХранилища(Хранилище) Экспорт
	
	Перем Настройки;
	
	Если ТипЗнч(Хранилище) = Тип("ХранилищеЗначения") Тогда
		Настройки = Хранилище.Получить();
		Настройки = ?(ТипЗнч(Настройки) = Тип("НастройкиКомпоновкиДанных"), Настройки, Неопределено);
	КонецЕсли;
	
	Возврат Настройки;

КонецФункции

Функция НастраиваемаяТаблица(ТаблицаИнтеграции) Экспорт
	Возврат (ИсключаемыеТаблицыИнтеграции().НайтиПоЗначению(ТаблицаИнтеграции) = Неопределено);
КонецФункции

Функция ПараметрыПроверкиНастройки() Экспорт
	
	Параметры = Новый Структура();
	
	Параметры.Вставить("ТаблицаИнтеграции");
	Параметры.Вставить("ИмяОбъекта");
	Параметры.Вставить("СхемаКомпоновкиДанных");
	Параметры.Вставить("НастройкиКомпоновкиДанных");
	Параметры.Вставить("ОсновнойОбъект");
	
	Возврат Параметры;
	
КонецФункции

// Проверить настройку.
// 
// Параметры:
//  ДанныеНастройки - Структура - Данные настройки см. ПараметрыПроверкиНастройки
// 
// Возвращаемое значение:
//  Булево - Проверить настройку
Функция ПроверитьНастройку(ДанныеНастройки) Экспорт
	
	ЗначительныеОшибки = Новый Массив();
	НеЗначительныеОшибки = Новый Массив();
	
	ВидОбъекта = ВидОбъектаКонфигурации(ДанныеНастройки.ИмяОбъекта);
	Если ДоступныеВидыОбъектовКНастройке().Найти(ВРег(ВидОбъекта)) = Неопределено Тогда
		ЗначительныеОшибки.Добавить(СтрШаблон(НСтр("ru = '[Таблица: %1]: Вид объекта ""%2"" не доступен для настройки'"), 
			ДанныеНастройки.ТаблицаИнтеграции, ВидОбъекта));
	КонецЕсли;
	
	Если ЗначительныеОшибки.Количество() = 0 Тогда
		
		МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ДанныеНастройки.ИмяОбъекта);
		Если МетаданныеОбъекта = Неопределено Тогда
			ЗначительныеОшибки.Добавить(СтрШаблон(НСтр("ru = '[Таблица: %1]: Объект метаданных по имени ""%2"" не найден'"), 
				ДанныеНастройки.ТаблицаИнтеграции, ДанныеНастройки.ИмяОбъекта));
		КонецЕсли;
	
	КонецЕсли;
	
	Если ЗначительныеОшибки.Количество() = 0 И ТипЗнч(ДанныеНастройки.СхемаКомпоновкиДанных) <> Тип("СхемаКомпоновкиДанных") Тогда
		ЗначительныеОшибки.Добавить(СтрШаблон(НСтр("ru = '[Таблица: %1] [Объект: %2]: Не инициализирована схема компоновки данных'"), 
			ДанныеНастройки.ТаблицаИнтеграции, ДанныеНастройки.ИмяОбъекта));
	КонецЕсли;
	
	Если ЗначительныеОшибки.Количество() = 0 И ТипЗнч(ДанныеНастройки.НастройкиКомпоновкиДанных) <> Тип("НастройкиКомпоновкиДанных") Тогда
		ЗначительныеОшибки.Добавить(СтрШаблон(НСтр("ru = '[Таблица: %1] [Объект: %2]: Не инициализированы настройки компоновки данных'"), 
			ДанныеНастройки.ТаблицаИнтеграции, ДанныеНастройки.ИмяОбъекта));
	КонецЕсли;
	
	Если ЗначительныеОшибки.Количество() = 0 Тогда
		
		Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных();
		SUI_КомпоновкаДанныхСервер.ИнициализироватьКомпоновщикНастроек(Компоновщик, ДанныеНастройки.СхемаКомпоновкиДанных, 
			ДанныеНастройки.НастройкиКомпоновкиДанных, СпособВосстановленияНастроекКомпоновкиДанных.Полное);
		
		НастройкиИзКомпоновщика = Компоновщик.ПолучитьНастройки();
			
		Если НастройкиИзКомпоновщика.Структура.Количество() <> 1 Или
			Не НастройкиИзКомпоновщика.Структура[0].Использование Или
			НастройкиИзКомпоновщика.Структура[0].Состояние <> СостояниеЭлементаНастройкиКомпоновкиДанных.Включен Или
			НастройкиИзКомпоновщика.Структура[0].Выбор.Элементы.Количество() <> 1 Или
			ТипЗнч(НастройкиИзКомпоновщика.Структура[0].Выбор.Элементы[0]) <> Тип("АвтоВыбранноеПолеКомпоновкиДанных") Или
			Не НастройкиИзКомпоновщика.Структура[0].Выбор.Элементы[0].Использование Тогда
			
			НеЗначительныеОшибки.Добавить(СтрШаблон(НСтр("ru = '[Таблица: %1] [Объект: %2]: В настройке компоновки данных отсутствует авто поле группировки'"), 
				ДанныеНастройки.ТаблицаИнтеграции, ДанныеНастройки.ИмяОбъекта));
			
		КонецЕсли;
		
		ОбязательныеКолонки = ПолучитьКолонкиТаблицыИнтеграции(ДанныеНастройки.ТаблицаИнтеграции).Скопировать(
			Новый Структура("Обязательный", Истина), "Имя").ВыгрузитьКолонку("Имя");
		
		СтруктураОбязательныеКолонки = Новый Структура();
		Для Каждого ОбязательнаяКолонка Из ОбязательныеКолонки Цикл
			СтруктураОбязательныеКолонки.Вставить(ОбязательнаяКолонка);
		КонецЦикла;
		
		Для Каждого ВыбранныйЭлемент Из НастройкиИзКомпоновщика.Выбор.Элементы Цикл
			
			ТекстОшибки = "";
			
			Если Не ЗначениеЗаполнено(ВыбранныйЭлемент.Заголовок) Тогда
				
				НеЗначительныеОшибки.Добавить(СтрШаблон(НСтр("ru = '[Таблица: %1] [Объект: %2]: Для поля ""%3"" не заполнен заголовок'"), 
					ДанныеНастройки.ТаблицаИнтеграции, ДанныеНастройки.ИмяОбъекта, Строка(ВыбранныйЭлемент.Поле)));
				
			ИначеЕсли СтруктураОбязательныеКолонки.Свойство(ВыбранныйЭлемент.Заголовок) Тогда
				
				Если Не ВыбранныйЭлемент.Использование Тогда
					ТекстОшибки = СтрШаблон(НСтр("ru = '[Таблица: %1] [Объект: %2]: Значение обязательного реквизита ""%3"" не используется'"), 
						ДанныеНастройки.ТаблицаИнтеграции, ДанныеНастройки.ИмяОбъекта, ВыбранныйЭлемент.Заголовок);
				ИначеЕсли Не ЗначениеЗаполнено(ВыбранныйЭлемент.Поле) Тогда
					ТекстОшибки = СтрШаблон(НСтр("ru = '[Таблица: %1] [Объект: %2]: Для обязательного реквизита ""%3"" не выбрано значение'"), 
						ДанныеНастройки.ТаблицаИнтеграции, ДанныеНастройки.ИмяОбъекта, ВыбранныйЭлемент.Заголовок);
				КонецЕсли;

				СтруктураОбязательныеКолонки.Удалить(ВыбранныйЭлемент.Заголовок);
				
			КонецЕсли;
			
			Если Не ПустаяСтрока(ТекстОшибки) Тогда
				ЗначительныеОшибки.Добавить(ТекстОшибки);
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого СтруктураОбязательныеКолонкиКлючЗначение Из СтруктураОбязательныеКолонки Цикл
			ЗначительныеОшибки.Добавить(СтрШаблон(НСтр("ru = '[Таблица: %1] [Объект: %2]: Отсутствует обязательный реквизит ""%3""'"), 
				ДанныеНастройки.ТаблицаИнтеграции, ДанныеНастройки.ИмяОбъекта, СтруктураОбязательныеКолонкиКлючЗначение.Ключ));	
		КонецЦикла;
		
		СтруктураОбязательныхПараметров = Новый Структура();
		Для Каждого ОбязательныйПараметр Из ПараметрыСКДПоОбъектуКонфигурации(МетаданныеОбъекта.ПолноеИмя()) Цикл
			СтруктураОбязательныхПараметров.Вставить(ОбязательныйПараметр);
		КонецЦикла;
		
		Для Каждого ПараметрДанных Из НастройкиИзКомпоновщика.ПараметрыДанных.Элементы Цикл
			
			ПараметрДанныхСтрокой = Строка(ПараметрДанных.Параметр);
			Если Не ПустаяСтрока(ПараметрДанныхСтрокой) И СтруктураОбязательныхПараметров.Свойство(ПараметрДанныхСтрокой) Тогда
				СтруктураОбязательныхПараметров.Удалить(ПараметрДанныхСтрокой);
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого СтруктураОбязательныхПараметровКлючЗначение Из СтруктураОбязательныхПараметров Цикл
			НеЗначительныеОшибки.Добавить(СтрШаблон(НСтр("ru = '[Таблица: %1] [Объект: %2]: Отсутствует обязательный параметр данных ""%3""'"), 
				ДанныеНастройки.ТаблицаИнтеграции, ДанныеНастройки.ИмяОбъекта, СтруктураОбязательныхПараметровКлючЗначение.Ключ));	
		КонецЦикла;
		
	КонецЕсли;
	
	Для индекс = 0 По ЗначительныеОшибки.ВГраница() Цикл
		ОбщегоНазначения.СообщитьПользователю(ЗначительныеОшибки[индекс]);
	КонецЦикла;
	
	Для индекс = 0 По НеЗначительныеОшибки.ВГраница() Цикл
		ОбщегоНазначения.СообщитьПользователю(НеЗначительныеОшибки[индекс]);
	КонецЦикла;
	
	Результат = Новый Структура();
	Результат.Вставить("ЕстьОшибки", (ЗначительныеОшибки.Количество() > 0 Или НеЗначительныеОшибки.Количество() > 0));
	Результат.Вставить("КритическаяОшибка", (ЗначительныеОшибки.Количество() > 0));
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьНастройкиВСтрокеДерева(СтрокаДерева, Дерево, КлючиСтрокОшибок)
	
	Если СтрокаДерева.ЭтоСтрокаТаблицы Тогда

		Для Каждого СтрокаСтрокиДерева Из СтрокаДерева.Строки Цикл
			
			ПроверитьНастройкиВСтрокеДерева(СтрокаСтрокиДерева, Дерево, КлючиСтрокОшибок);
			
		КонецЦикла;
	
	Иначе

		СтрокаРодитель = СтрокаДерева.Родитель;
		
		Если СтрокаРодитель = Неопределено Или Не ЗначениеЗаполнено(СтрокаРодитель.ТаблицаИнтеграции) Тогда
			ВызватьИсключение НСтр("ru = 'Отсутствует строка родитель'");
		КонецЕсли;
		
		ВидОбъекта = ВидОбъектаКонфигурации(СтрокаДерева.ИмяОбъектаКонфигурации);
		Если ДоступныеВидыОбъектовКНастройке().Найти(ВРег(ВидОбъекта)) = Неопределено Тогда
			КлючиСтрокОшибок.Добавить(СтрокаДерева.Ключ);
			ТекстОшибки = СтрШаблон(НСтр("ru = '[%1]: Вид объекта ""%1"" не доступен для настройки'"), 
				СтрокаРодитель.ТаблицаИнтеграции, ВидОбъекта);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
			Возврат;
		КонецЕсли;
	
		МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(СтрокаДерева.ИмяОбъектаКонфигурации);
		
		Если МетаданныеОбъекта = Неопределено Тогда
			КлючиСтрокОшибок.Добавить(СтрокаДерева.Ключ);
			ТекстОшибки = СтрШаблон(НСтр("ru = '[%1]: Объект метаданных по имени ""%2"" не найден'"), 
				СтрокаРодитель.ТаблицаИнтеграции, СтрокаДерева.ИмяОбъектаКонфигурации);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
			Возврат;
		КонецЕсли;
		
		СхемаКомпоновкиДанных = ОбщегоНазначения.ЗначениеИзСтрокиXML(СтрокаДерева.СхемаКомпоновкиДанных);
		
		Если ТипЗнч(СхемаКомпоновкиДанных) <> Тип("СхемаКомпоновкиДанных") Тогда
			КлючиСтрокОшибок.Добавить(СтрокаДерева.Ключ);
			ТекстОшибки = СтрШаблон(НСтр("ru = '[%1] [%2]: Не инициализирована схема компоновки данных'"), 
				СтрокаРодитель.ТаблицаИнтеграции, СтрокаДерева.ИмяОбъектаКонфигурации);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
			Возврат;
		КонецЕсли;
		
		НастройкиКомпоновкиДанных = ОбщегоНазначения.ЗначениеИзСтрокиXML(СтрокаДерева.НастройкиКомпоновкиДанных);
		
		Если ТипЗнч(НастройкиКомпоновкиДанных) <> Тип("НастройкиКомпоновкиДанных") Тогда
			КлючиСтрокОшибок.Добавить(СтрокаДерева.Ключ);
			ТекстОшибки = СтрШаблон(НСтр("ru = '[%1] [%2]: Не инициализированы настройки компоновки данных'"), 
				СтрокаРодитель.ТаблицаИнтеграции, СтрокаДерева.ИмяОбъектаКонфигурации);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
			Возврат;
		КонецЕсли;
		
		Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных();
		SUI_КомпоновкаДанныхСервер.ИнициализироватьКомпоновщикНастроек(Компоновщик, СхемаКомпоновкиДанных, 
			НастройкиКомпоновкиДанных, СпособВосстановленияНастроекКомпоновкиДанных.Полное);
		
		НастройкиИзКомпоновщика = Компоновщик.ПолучитьНастройки();
		
		Если НастройкиИзКомпоновщика.Структура.Количество() <> 1 Или
			Не НастройкиИзКомпоновщика.Структура[0].Использование Или
			НастройкиИзКомпоновщика.Структура[0].Состояние <> СостояниеЭлементаНастройкиКомпоновкиДанных.Включен Или
			НастройкиИзКомпоновщика.Структура[0].Выбор.Элементы.Количество() <> 1 Или
			ТипЗнч(НастройкиИзКомпоновщика.Структура[0].Выбор.Элементы[0]) <> Тип("АвтоВыбранноеПолеКомпоновкиДанных") Или
			Не НастройкиИзКомпоновщика.Структура[0].Выбор.Элементы[0].Использование Тогда
			
			КлючиСтрокОшибок.Добавить(СтрокаДерева.Ключ);
			
			ТекстОшибки = СтрШаблон(НСтр("ru = '[%1] [%2]: В настройке компоновки данных отсутствует авто поле группировки'"), 
				СтрокаРодитель.ТаблицаИнтеграции, СтрокаДерева.ИмяОбъектаКонфигурации);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
			
		КонецЕсли;
		
		ОбязательныеКолонки = ПолучитьКолонкиТаблицыИнтеграции(СтрокаРодитель.ТаблицаИнтеграции).Скопировать(
			Новый Структура("Обязательный", Истина), "Имя").ВыгрузитьКолонку("Имя");
		
		СтруктураОбязательныеКолонки = Новый Структура();
		Для Каждого ОбязательнаяКолонка Из ОбязательныеКолонки Цикл
			СтруктураОбязательныеКолонки.Вставить(ОбязательнаяКолонка);
		КонецЦикла;
		
		ЗаголовкиПолей = Новый Структура();
		
		Для Каждого ВыбранныйЭлемент Из НастройкиИзКомпоновщика.Выбор.Элементы Цикл
			
			Если Не ВыбранныйЭлемент.Использование Тогда
				Продолжить;
			КонецЕсли;
			
			ДоступноеПолеВыбора = Неопределено;
			ТекстОшибки = "";
			
			Если Не ЗначениеЗаполнено(ВыбранныйЭлемент.Поле) Тогда
				ТекстОшибки = НСтр("ru = 'Не заполнено поле для выбранного реквизита.
				|Выберите поле или отключите использование.'");
			Иначе
				
				ДоступноеПолеВыбора = НастройкиИзКомпоновщика.Выбор.ДоступныеПоляВыбора.НайтиПоле(ВыбранныйЭлемент.Поле);
				
				Если ПустаяСтрока(ВыбранныйЭлемент.Заголовок) Тогда
					ТекстОшибки = НСтр("ru = 'Не установлен заголовок для выбранного реквизита.
					|Установите заголовок или отключите использование.'");
				Иначе
					
					Попытка
						
						Если ЗаголовкиПолей.Свойство(ВыбранныйЭлемент.Заголовок) Тогда
							ТекстОшибки = НСтр("ru = 'Обнаружены повторяющийся заголовок.
							|Измените заголовок или отключите использование.'");
						Иначе
							ЗаголовкиПолей.Вставить(ВыбранныйЭлемент.Заголовок);
						КонецЕсли;
						
					Исключение
						ТекстОшибки = СтрШаблон(НСтр("ru = 'В заголовке ""%1"" используются недопустимые символы.
						|Измените заголовок с использованием алфавитно-цифровых символы и знаков разделителей ""_"" или отключите использование.'"),
						ВыбранныйЭлемент.Заголовок);
					КонецПопытки;
					
					Если ПустаяСтрока(ТекстОшибки) И СтруктураОбязательныеКолонки.Свойство(ВыбранныйЭлемент.Заголовок) Тогда
						СтруктураОбязательныеКолонки.Удалить(ВыбранныйЭлемент.Заголовок);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если Не ПустаяСтрока(ТекстОшибки) Тогда
				
				Если ДоступноеПолеВыбора = Неопределено Тогда
					ТекстОшибки = СтрШаблон("[%1][%2]: %3", 
						СтрокаРодитель.ТаблицаИнтеграции, СтрокаДерева.ИмяОбъектаКонфигурации, ТекстОшибки);
				Иначе
					ТекстОшибки = СтрШаблон("[%1][%2][%3]: %4", 
						СтрокаРодитель.ТаблицаИнтеграции, СтрокаДерева.ИмяОбъектаКонфигурации, 
						ДоступноеПолеВыбора.Заголовок, ТекстОшибки);
				КонецЕсли;
				
				КлючиСтрокОшибок.Добавить(СтрокаДерева.Ключ);
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "НастройкиВыбор");
				
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого СтруктураОбязательныеКолонкиКлючЗначение Из СтруктураОбязательныеКолонки Цикл
			КлючиСтрокОшибок.Добавить(СтрокаДерева.Ключ);
			ТекстОшибки = СтрШаблон(НСтр("ru = '[%1] [%2]: Отсутствует обязательный реквизит ""%3""'"), 
				СтрокаРодитель.ТаблицаИнтеграции, СтрокаДерева.ИмяОбъектаКонфигурации, СтруктураОбязательныеКолонкиКлючЗначение.Ключ);	
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		КонецЦикла;
		
		СтруктураОбязательныхПараметров = Новый Структура();
		Для Каждого ОбязательныйПараметр Из ПараметрыСКДПоОбъектуКонфигурации(МетаданныеОбъекта.ПолноеИмя()) Цикл
			СтруктураОбязательныхПараметров.Вставить(ОбязательныйПараметр);
		КонецЦикла;
		
		Для Каждого ПараметрДанных Из НастройкиИзКомпоновщика.ПараметрыДанных.Элементы Цикл
			
			ПараметрДанныхСтрокой = Строка(ПараметрДанных.Параметр);
			Если Не ПустаяСтрока(ПараметрДанныхСтрокой) И СтруктураОбязательныхПараметров.Свойство(ПараметрДанныхСтрокой) Тогда
				СтруктураОбязательныхПараметров.Удалить(ПараметрДанныхСтрокой);
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого СтруктураОбязательныхПараметровКлючЗначение Из СтруктураОбязательныхПараметров Цикл
			КлючиСтрокОшибок.Добавить(СтрокаДерева.Ключ);
			ТекстОшибки = СтрШаблон(НСтр("ru = '[%1] [%2]: Отсутствует обязательный параметр данных ""%3""'"), 
				СтрокаРодитель.ТаблицаИнтеграции, СтрокаДерева.ИмяОбъектаКонфигурации, СтруктураОбязательныхПараметровКлючЗначение.Ключ);	
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьПараметрыПоИсточнику(НастройкиКомпоновки, Источник)
	
	Если Источник = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КлючПараметрыСтруктуры = Новый УникальныйИдентификатор();
	ПараметрыСтруктура = Новый Структура();

	Для Каждого ПараметрДанных Из НастройкиКомпоновки.ПараметрыДанных.Элементы Цикл
		ПараметрыСтруктура.Вставить(Строка(ПараметрДанных.Параметр), КлючПараметрыСтруктуры);
	КонецЦикла;
	
	Если ОбщегоНазначения.ЭтоРегистр(Источник.Метаданные()) Тогда
		
		Для Каждого ЭлементОтбора Из Источник.Отбор Цикл

			Если ПараметрыСтруктура.Свойство(ЭлементОтбора.Имя) Тогда
				ПараметрыСтруктура.Вставить(ЭлементОтбора.Имя, ЭлементОтбора.Значение);
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		ЗаполнитьЗначенияСвойств(ПараметрыСтруктура, Источник);
	КонецЕсли;

	Для Каждого ПараметрСтруктура Из ПараметрыСтруктура Цикл
			
		Если ПараметрСтруктура.Значение <> КлючПараметрыСтруктуры Тогда
			SUI_КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НастройкиКомпоновки, ПараметрСтруктура.Ключ, ПараметрСтруктура.Значение);
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьСлужебныеПоляВыбора(НастройкиКомпоновкиДанных, СлужебныеПоля, ПрефиксСлужебногоПоля)
	
	Если СлужебныеПоля.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ДоступноеПоле Из НастройкиКомпоновкиДанных.ПользовательскиеПоля.ДоступныеПоляЗначений.Элементы Цикл
		
		ИмяПоля = Строка(ДоступноеПоле.Поле);
		
		Если СлужебныеПоля.Найти(ИмяПоля) <> Неопределено Тогда
			
			ПользовательскоеПоле = НастройкиКомпоновкиДанных.ПользовательскиеПоля.Элементы.Добавить(
				Тип("ПользовательскоеПолеВыборКомпоновкиДанных"));
			ПользовательскоеПоле.Заголовок = ПрефиксСлужебногоПоля + ИмяПоля;
			ВариантПользовательскогоПоля = ПользовательскоеПоле.Варианты.Элементы.Добавить();
			ВариантПользовательскогоПоля.Значение = ДоступноеПоле.Поле;
			
			SUI_КомпоновкаДанныхКлиентСервер.ДобавитьВыбранноеПоле(НастройкиКомпоновкиДанных, 
				ПользовательскоеПоле.ПутьКДанным, ПользовательскоеПоле.Заголовок);

		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ИсключаемыеТаблицыИнтеграции()
	
	ИсключаемыеТаблицы = Новый СписокЗначений();
	
	ИсключаемыеТаблицы.Добавить(Перечисления.SUI_ТаблицыИнтеграции.ПользователиТСД);

	Возврат ИсключаемыеТаблицы;
	
КонецФункции

#КонецОбласти

#КонецЕсли
